// Створити клас "Книга" з властивостями, такими як назва, автор і рік видання.
// Забезпечте клас методом, який дозволить вивести інформацію про книгу в консоль.
// Створити екземпляр класу "Книга" і викликати метод для виведення інформації про цю книгу.

// Створюємо об'єкт книги без класу
let myBook = {
    title: "Франц Кафка Письма Мілені",
    author: "Франц Кафка ",
    year: 2011,
    getInfoAboutbook: function() {
      console.log("Назва: " + myBook.title + ", Автор: " + myBook.author + ", Рік видання: " + myBook.year);
    }
  };
  
  myBook.getInfoAboutbook(); 
  



// Завдання з успадкуванням:
// Створити клас "Тварина" з властивостями, такими як назва і звук, а також методом,
// який виводить повідомлення про звук тварини.
// Створити клас "Собака", який успадковує від класу "Тварина" і має додаткову властивість - порода собаки.
// Забезпечте клас "Собака" методом, який виводить повідомлення про звук собаки, додавши в нього породу.
// Створити екземпляр класу "Собака" і викликати метод для виведення повідомлення про звук собаки з породою.



class Animal {
  
    makeSound(name, sound) {
      console.log(name + " робить звук: " + sound);
    }
  }

  class Dog {
   
    makeSound(name, sound, breed) {
      console.log("Собака породи " + breed + " робить звук: " + sound);
    }
  }
  

  let animal = new Animal();
  animal.makeSound("Тварина", "звук"); 
  
  
  let dog = new Dog();
  dog.makeSound("Чокопай", "гав-гав-гав", "мопс"); 
  